In [1]:
import pandas as pd

In [2]:
orders = pd.read_table('http://bit.ly/chiporders')

In [3]:
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

ผลลัพท์ถูกต้องเนื่องจากไฟล์ที่โหลดมาได้มีการจัดทำรูปแบบแบ่งคอลัมน์ด้วยแทปเรียบร้อยแล้ว

In [4]:
users = pd.read_table('http://bit.ly/movieusers')
users.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

ลองโหลดอีกไฟล์พบว่าไฟล์มีรูปแบบการแบ่งคอลัมน์ด้วย '|' ทำให้ pandas ไม่สามารถแบ่งคอลัมน์อย่างถูกต้อง ดังนั้นเราจะใช้พารามิเตอร์ที่ชือว่า sep เพื่อกำหนดตัวอักษรที่จะใช้สำหรับการแบ่งคอมลัมน์ดังนี้

In [5]:
users = pd.read_table('http://bit.ly/movieusers', sep='|')
users.head()

   1  24  M  technician  85711
0  2  53  F       other  94043
1  3  23  M      writer  32067
2  4  24  M  technician  43537
3  5  33  F       other  15213
4  6  42  M   executive  98101

ผลที่ได้เริ่มดูดี แต่สังเกตุได้ว่าข้อมูลแถวแรกถูกนำไปใช้เป็นชื่อคอลัมน์ ดังนั้นเราจะบอกตัว pandas ก่อนว่าแถวแรกเป็นข้อมูลด้วยพารามิเตอร์ header=None

In [6]:
users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None)
users.head()

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

ต่อมาเราจะกำหนดชือคอลัมน์ด้วยตัวของเราเองด้วยการส่งชื่อคอลัมน์ทั้งหมดผ่านพารามิเตอร์ names

In [7]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols)
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

ได้ผลลัพท์ตามที่คาดหวัง ;P